CSI API ETABS v1
cPropFrame.GetRebarColumn_1 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRebarColumn_1(
	string Name,
	ref string MatPropLong,
	ref string MatPropConfine,
	ref int Pattern,
	ref int ConfineType,
	ref double Cover,
	ref int NumberCBars,
	ref int NumberR3Bars,
	ref int NumberR2Bars,
	ref string RebarSize,
	ref string TieSize,
	ref double TieSpacingLongit,
	ref int Number2DirTieBars,
	ref int Number3DirTieBars,
	ref bool ToBeDesigned,
	ref string LongitCornerRebarSize,
	ref double LongitRebarArea,
	ref double LongitCornerRebarArea
)
Function GetRebarColumn_1 (
	Name As String,
	ByRef MatPropLong As String,
	ByRef MatPropConfine As String,
	ByRef Pattern As Integer,
	ByRef ConfineType As Integer,
	ByRef Cover As Double,
	ByRef NumberCBars As Integer,
	ByRef NumberR3Bars As Integer,
	ByRef NumberR2Bars As Integer,
	ByRef RebarSize As String,
	ByRef TieSize As String,
	ByRef TieSpacingLongit As Double,
	ByRef Number2DirTieBars As Integer,
	ByRef Number3DirTieBars As Integer,
	ByRef ToBeDesigned As Boolean,
	ByRef LongitCornerRebarSize As String,
	ByRef LongitRebarArea As Double,
	ByRef LongitCornerRebarArea As Double
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim MatPropLong As String
Dim MatPropConfine As String
Dim Pattern As Integer
Dim ConfineType As Integer
Dim Cover As Double
Dim NumberCBars As Integer
Dim NumberR3Bars As Integer
Dim NumberR2Bars As Integer
Dim RebarSize As String
Dim TieSize As String
Dim TieSpacingLongit As Double
Dim Number2DirTieBars As Integer
Dim Number3DirTieBars As Integer
Dim ToBeDesigned As Boolean
Dim LongitCornerRebarSize As String
Dim LongitRebarArea As Double
Dim LongitCornerRebarArea As Double
Dim returnValue As Integer
returnValue = instance.GetRebarColumn_1(Name,
	MatPropLong, MatPropConfine, Pattern,
	ConfineType, Cover, NumberCBars,
	NumberR3Bars, NumberR2Bars, RebarSize,
	TieSize, TieSpacingLongit, Number2DirTieBars,
	Number3DirTieBars, ToBeDesigned,
	LongitCornerRebarSize, LongitRebarArea,
	LongitCornerRebarArea)
int GetRebarColumn_1(
	String^ Name,
	String^% MatPropLong,
	String^% MatPropConfine,
	int% Pattern,
	int% ConfineType,
	double% Cover,
	int% NumberCBars,
	int% NumberR3Bars,
	int% NumberR2Bars,
	String^% RebarSize,
	String^% TieSize,
	double% TieSpacingLongit,
	int% Number2DirTieBars,
	int% Number3DirTieBars,
	bool% ToBeDesigned,
	String^% LongitCornerRebarSize,
	double% LongitRebarArea,
	double% LongitCornerRebarArea
)
abstract GetRebarColumn_1 :
        Name : string *
        MatPropLong : string byref *
        MatPropConfine : string byref *
        Pattern : int byref *
        ConfineType : int byref *
        Cover : float byref *
        NumberCBars : int byref *
        NumberR3Bars : int byref *
        NumberR2Bars : int byref *
        RebarSize : string byref *
        TieSize : string byref *
        TieSpacingLongit : float byref *
        Number2DirTieBars : int byref *
        Number3DirTieBars : int byref *
        ToBeDesigned : bool byref *
        LongitCornerRebarSize : string byref *
        LongitRebarArea : float byref *
        LongitCornerRebarArea : float byref -> int
Parameters
Name
Type: System.String
MatPropLong
Type: System.String
MatPropConfine
Type: System.String
Pattern
Type: System.Int32
ConfineType
Type: System.Int32
Cover
Type: System.Double
NumberCBars
Type: System.Int32
NumberR3Bars
Type: System.Int32
NumberR2Bars
Type: System.Int32
RebarSize
Type: System.String
TieSize
Type: System.String
TieSpacingLongit
Type: System.Double
Number2DirTieBars
Type: System.Int32
Number3DirTieBars
Type: System.Int32
ToBeDesigned
Type: System.Boolean
LongitCornerRebarSize
Type: System.String
LongitRebarArea
Type: System.Double
LongitCornerRebarArea
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace